<template>
    <div class="argeement">
        <el-dialog
            title="ユーザー登録及び利用規約"
            :visible.sync="xieyi"
            width="80%"
            :modal-append-to-body="false"
            top="10vh"
            :showClose="false"
            :close-on-click-modal="false"
        >
            <div class="Language">
                <span @click="tag(1)" :class="Language == 1 ? 'curLan' : ''"
                    >中国語</span
                >
                <span @click="tag(2)" :class="Language == 2 ? 'curLan' : ''"
                    >日本語</span
                >
            </div>
            <div class="cnt">
                <div v-if="Language == 1" class="cnt-lan chinese">
                    <h1>用户注册与使用协议</h1>
                    <div class="section">
                        本网站由北京联合信任技术服务有限公司（以下简称“联合信任”）负责运营。本用户注册与使用协议（以下简称“本协议”）具有合同效力，协议双方为联合信任与本网站的注册用户（以下简称“用户”），适用于注册用户在本网站的全部活动。
                    </div>
                    <div class="section">
                        在成为本网站的注册用户前请务必仔细阅读本协议的全部内容，若不同意或不理解本协议的任何内容，请不要进行后续操作。
                    </div>
                    <div class="section">
                        完成本网站的全部注册操作后即成为本网站的注册用户，这表明用户对本协议的全部内容已充分阅读、理解和同意遵守（用户不应以未阅读本协议的内容等理由，主张本协议无效，或要求撤销）。同时，用户承诺遵守中国法律、法规、规章及其他政府规范性文件的规定，如有违反将独立承担所有相应的法律责任。
                    </div>
                    <h2>一、 声明与告知</h2>
                    <div class="section">
                        <p>
                            <b>1.</b
                            >本协议的内容包括以下全部条款以及本网站已经发布的及将来可能发布的与用户有关的各项规则，该等规则均为本协议不可分割的一部分，与本协议具有同等法律效力。
                        </p>
                        <p>
                            <b>2.</b
                            >本网站有权根据经营需要修改本协议的内容。如本协议条款或本网站各项规则有任何变更，本网站将在网站上刊载公告。经修订的相关条款和规则一经公告，即于公告规定的特定生效日期自动生效。请用户适时关注本网站关于相关条款和规则的公告，如不同意该等变更，请用户在该等变更的公告刊载之日起 72小时内以用户在本网站注册时提供的个人邮箱向本网站的服务邮箱_【】_发送邮件明确表明希望终止本协议（“注销申请”），本网站确认收到用户的邮件后将与用户协商本协议的终止以及终止后双方权利义务的履行。如用户在本条款所述时限内未发送注册终止申请，则本条款所述时限届满之时，视为用户已经同意接受该等变更，经修订的相关条款和规则一经公告，即于公告规定的特定生效日期自动生效并对用户产生法律约束力。
                        </p>
                        <p>
                            <b>3.</b
                            >本网站有权中止、终止或者限制提供相关服务的部分功能，或提供新的功能，在任何功能减少、增加或者变化时，只要用户仍然使用本服务，表示用户仍然同意本协议或者变更后的协议。
                        </p>
                        <p>
                            <b>4.</b
                            >本协议不涉及本网站注册用户之间因使用本网站服务而产生的法律关系及法律纠纷。
                        </p>
                        <p>
                            <b>5.</b
                            >本网站保留中止、终止或限制用户使用本网站服务的权利，但该等终止、中止或限制行为并不必然导致用户之前合法使用本网站服务产生的数据无效或被删除。
                        </p>
                        <p>
                            <b>6.</b
                            >用户应妥善保管自己的账户密码等账户信息，用户不得以账户密码等账户信息被盗用或其他理由否认在本网站的任何操作。
                        </p>
                        <p>
                            <b>7.</b
                            >联合信任对本网站内所有非公有领域或非他方专有的信息内容享有知识产权（包括但不限于商标权、专利权、著作权），信息内容包括但不限于文字、图片、软件、音频、视频、数据、源代码、设计，非经联合信任书面授权同意，禁止复制、打印和传播属于联合信任的信息内容用于其他用途。
                        </p>
                        <p>
                            <b>8.</b
                            >联合信任对本网站所有的产品、技术及程序享有知识产权，非经联合信任书面授权许可，禁止使用（包括但不限于以非法的方式打印、复制、传播、展示、下载等）。
                        </p>
                    </div>
                    <h2>二、 名词解释</h2>
                    <div class="section">
                        <p>
                            1.账户：是本网站为用户提供的电子信息空间，且用户在本网站拥有唯一编号。用户可自行为该账户设置密码，并用以查询或使用本网站提供的服务。用户需使用本人电子邮箱或手机号码，或者本公司允许的其它方式登录该账户。
                        </p>
                        <p>2.本网站：除本协议另有规定外仅指 jp.tsa.cn</p>
                        <p>
                            3.时间戳：是由联合信任时间戳服务中心（TSA：TimeStamp Authority）颁发的具有法律效力的电子凭证,用于证明电子数据申请认证的时间和内容完整性。
                        </p>
                        <p>
                            4.时间戳的认证：用户申请可信时间戳认证，只需将电子数据的哈希（Hash）值上传。本网站将接收到的电子数据的哈希（Hash）值后与权威时间源绑定（由国家授时中心负责授时和守时，即电子数据申请时间戳认证后申请时间将无法修改），在此基础上通过联合信任的私钥进行签名，生成不可伪造的时间戳文件（后缀名为.tsa 的文件）。
                        </p>
                        <p>
                            5.时间戳的验证：用户对电子数据进行时间戳验证时将电子数据与对应的时间戳文件（包含电子数据的哈希值和权威时间）进行技术比对，可以有效确认电子数据的产生时间及自形成时起内容是否保持完整、未被更改。
                        </p>
                        <p>
                            6.电子签章：是电子签名的一种表现形式的实现工具，利用图像处理技术将电子签名操作转化为与纸质文件盖章操作相同的可视效果。
                        </p>
                        <p>
                            7.数字证书：是一个经证书授权中心数字签名的包含公开密钥拥有者信息（即名称以及证书授权中心的数字签名）以及公开密钥的文件。数字证书只在特定的时间段内有效。同时集成第三方数字证书和可信时间戳可以实现可靠电子签名，保障电子信息的真实性和完整性以及签名人的不可否认性。
                        </p>
                        <p>
                            8.电子证据固化：是指平台所产生的电子数据即时加盖由联合信任时间戳服务中心（TSA：Time StampAuthority）颁发的时间戳，以确保该数据满足《电子签名法》第二章第五条数据电文原件形式之规定。
                        </p>
                        <p>
                            9.GPS定位系统：是指利用卫星，在全球范围内实时进行定位、导航的系统，简称 GPS(Global Positioning System)。
                        </p>
                        <p>
                            10.GPS定位误差：通过地面接收设备接收卫星传送来的信息，计算同一时刻地面接收设备到多颗卫星之间的伪距离，采用空间距离后方交会方法，来确定地面点的三维坐标。对于 GPS卫星、卫星信号传播过程和地面接收设备都会 对 GPS定位产生误差。
                        </p>
                    </div>
                    <h2>三、 服务内容和服务费用</h2>
                    <div class="section">
                        <p>1. 本网站提供的服务包括:</p>
                        <div class="section-child">
                            <p>
                                1)可信时间戳服务：联合信任为各行业提供符合RFC3161 标准的可信时间戳服务，对外开放 API接口，各类应用系统只要按照标准即可接入本网站并获取服务。
                            </p>
                            <p>
                                2)可靠电子签名（电子合同）服务：实现传统纸质合同签署的电子化，主要包括实名认证，合同签署，合同管理，签署提醒等功能，可根据用户需求实现多种电子合同签约的部署方式。
                            </p>
                            <p>
                                3)知识产权保护服务：对文学、艺术和自然科学、社会科学、工程技术等各类作品进行可信时间戳认证，用于证明申请认证的知识产权（电子数据、文件）是谁（who）在什么时间（when）拥有一个什么样的作品（what）。
                            </p>
                            <p>
                                4)电子证据固化保全服务：及时固定证据、防止证据灭失，客观真实的还原事实真相。
                            </p>
                            <p>
                                5)接受用户的委托为用户提供的其他服务。
                            </p>
                        </div>
                        <p>
                            2.用户使用本网站提供的服务，均需另行完成开通操作，并遵守相关服务规则。
                        </p>
                        <p>
                            3.当用户使用本网站提供的服务，本网站有权向用户收取相应的服务费用。联合信任授权日本技术贸易株式会社在日本代理销售乙方运营的日文版可信时间戳服务的知识产权保护系统，并代为向用户收取服务费用。各项服务具体费用标准请直接联系本网站公布的客服电话或参看本网站上公布的业务定价及有关规则。用户应按照与日本技术贸易株式会社签订的协议支付相关服务费用，未按照约定交费联合信任有权停止该用户继续使用联合信任的服务。
                        </p>
                        <p>
                            4.联合信任拥有单方面制定与调整各项服务费用的权利，费用调整规则以本网站公布为准。
                        </p>
                    </div>
                    <h2>四、注册与注销</h2>
                    <div class="section">
                        <p>
                            1.注册用户包括企业用户和个人用户。企业用户是在日本境内设立的，能够独立承担民事责任的法人和其他组织。个人用户是指日本公民，并且符合日本法律规定的具有完全民事行为能力，能够独立承担民事责任的自然人（例外：本网站的部分功能可以向日本法律规定的未成年人提供服务，但需要单独提出申请并完成注册）。
                        </p>
                        <p>
                            2.个人及企业在本网站完成注册即可成为注册用户，成为注册用户后须进行实名认证，实名认证通过后方有权利开通本网站的服务。
                        </p>
                        <p>
                            3.在注册、实名认证、使用本网站服务的所有期间，用户应提供真实资料和信息，并保证自注册之时起至使用本网站服务的所有期间，用户所提交的所有资料和信息真实、准确、完整，且是最新的。根据实名认证方式的不同，个人所需提供的实名认证资料将有所差异，具体所需资料请以本网站要求为准。
                        </p>
                        <p>
                            4.因国家法律法规、部门规章或监管机构的要求，本网站需要用户补充提供任何相关资料时，如用户不能及时配合提供，本网站有权中止或终止向该用户提供部分或全部服务，就此产生的损失联合信任不承担任何责任。
                        </p>
                        <p>
                            5.在用户决定不再使用该账户时，用户应将该账户内的可用数据先行导出或删除后，再并按本网站规定流程向本网站申请注销该账户，否则因账户注销导致的数据丢失用户自行承担。异常账户（处于中止状态的账户）需按提示操作并恢复正常后方可进行注销。账户注销后，本协议自动终止，本网站有权选择不可恢复的清除账户内全部数据或保留账户内的相关信息，任何基于已清除的账户内数据而产生的未了结的权利义务与联合信任无关。
                        </p>
                        <p>
                            6.用户申请注销账户一旦成功，将不再予以恢复，如需再次使用和开通服务应重新进行注册。
                        </p>
                        <p>
                            7.用户理解并同意，如用户连续 24个月未登录过其在本网站的注册账户，且用户在本网站无任何剩余资产或在本网站无任何数据留存或无任何服务的使用痕迹，本公司有权无需通知即注销该用户的注册账户。
                        </p>
                    </div>
                    <h2>五、使用与使用限制</h2>
                    <div class="section">
                        <p>
                            1.如用户向本网站提供的各项信息和资料发生变更，应当及时向本网站更新相应的信息和资料，如因用户未及时更新信息和资料导致本网站无法向用户提供服务或发生错误，由此导致的全部法律责任和后果将由用户独立承担。
                        </p>
                        <p>
                            2.基于计算机端、手机端以及其他电子设备的用户使用习惯，本网站有权在用户使用具体产品时设置相同或不同的账户登录模式及采取不同的措施识别用户的身份，并将同一身份用户纳入同一账户进行管理。
                        </p>
                        <p>
                            3.使用本网站服务，用户应遵从本协议或网站说明页面中的操作提示、规则，否则造成无法达成使用服务之目的的由用户自行承担责任。
                        </p>
                        <p>4.
                            用户在本网站登录状态结束时，应以正确步骤退出账户。因用户未遵守本条规定而发生的任何损失及不利后果由用户自行承担责任。
                        </p>
                        <p>
                            5.如用户发现他人冒用或盗用其账户及密码或任何其他未经合法授权之情形，或发生与账户关联的手机或其他设备遗失或其他可能危及到账户安全的情形时，应立即以有效方式通知本网站，向本网站申请中止相关服务。对用户的申请中止相关服务或采取其他行动需要合理期限，在此之前，对本网站已执行的指令及(或)所导致的任何损失用户自行承担责任。
                        </p>
                        <p>
                            6.如用户使用他人信息和文件注册使用本网站服务或向本网站提供的信息和资料不符合注册的相关规定，由此引起的一切责任和后果均由实际进行注册的人全部承担，本网站不因此承担任何法律责任，如因此而给本网站及其他用户造成任何损失，用户应当承担赔偿本网站及其他用户损失的责任。
                        </p>
                        <p>
                            7.用户不得利用本网站或本网站服务从事任何不符合中国法律法规、违反本协议或本网站其他规则、侵犯他人权益的活动。本网站在发现用户从事该等活动时，有权不经通知而立即中止或终止用户对本网站的全部或部分功能的使用。
                        </p>
                        <p>
                            8.在使用本网站提供的服务（包括但不限于站内信服务、群组服务、论坛服务或其他电子邮件转发服务）的过程中，用户不得发送、公布或展示任何垃圾邮件或其他可能违反中国法律法规及本协议内容的信息。本网站在发现用户从事该等活动或发布该等内容时，有权不经用户同意而阻止该等活动并删除该等内容，同时有权不经通知而立即中止或终止用户对本网站的全部或部分功能的使用。
                        </p>
                        <p>
                            9.用户同意,在一些情况下本网站有权利中止或终止用户对本网站的全部或部分功能的使用，这些情况包括但不限于根据本协议的约定、法律法规及法律文书的规定、有权机关的要求；本网站基于单方面合理判断认为账户操作存在异常或风险；用户遭到第三方投诉，且第三方已经提供了相关证据。发生上述情况造成中止或终止用户对本网站的全部或部分功能的使用的，本网站将即时通知用户。如账户中止的用户需要恢复服务，应按本网站通知的具体要求提交相关信息、资料、说明等文件，以便本网站进行核实，且本网站有权自行决定是否同意用户的申请。
                        </p>
                        <p>
                            10.中止用户使用本网站全部功能或部分功能即为账户中止，账户中止后本网站仍将保存账户内的所有相关资料，且可以查询和为用户提供相关文件内容的证明。
                        </p>
                        <p>
                            11.终止用户使用本网站全部功能即为账户终止，账户终止将导致账户被注销的结果，由此产生的一切后果由用户自行承担（包括但不限于清除账户内的数据、无法查询、无法为用户提供相关文件内容的证明）。
                        </p>
                        <p>
                            12.用户在注册时向本网站提交的电话、邮箱、用户名、密码及支付安全密码是用户在本网站的唯一识别信息。用户注册成功后，除非本协议另有约定，不得将注册的电话、邮箱、用户名、密码及支付安全密码转让或授权给第三方使用。用户确认，使用用户名和密码登陆本网站后在本网站的一切行为以及以用户在本网站注册时提交的个人电子邮箱发送邮件的行为均代表用户本人并由用户承担相应的法律后果。本网站按照用户操作发出的指令即时执行，除本网站提供撤销功能的服务外一律不可撤回或撤销。
                        </p>
                        <p>
                            13.用户认可，账户内的数据以本网站记录为准，如用户对该等数据存有异议的，应自用户账户数据发生变动之日起 72小时内向本公司提出异议，并提供相关证据供本网站核实，否则视为用户认可该数据。
                        </p>
                        <p>四、通知及送达</p>
                        <p>
                            1.
                            本协议项下的通知如以公示方式作出，一经在本网站公示即视为已经送达。
                        </p>
                        <p>
                            2.
                            除此之外，其他向用户个人发布的具有专属性的通知将由本网站向用户在注册时或者注册后变更用户信息时向本网站提供的邮箱，或在本网站上用户个人账户中为用户设置的“用户消息”，一经发送即视为已经送达（本网站对用户是否收到或者及时收到该通知不承担责任）。
                        </p>
                        <p>
                            3.
                            用户承诺密切关注用户的邮箱、“用户消息”中的邮件信息，任何信息从本网站发出起，即视为已告知用户，用户不得以任何理由否认本协议变更后的效力或拒绝履行相关的义务。
                        </p>
                    </div>
                    <h2>六、 责任限制与免责条款</h2>
                    <div class="section">
                        <p>1.联合信任仅承担本协议中明确约定的责任。</p>
                        <p>
                            2.
                            以本网站提供的服务为基础而形成的交易所产生的任何风险应由用户与交易对方承担，本网站对此不提供任何形式的担保。
                        </p>
                        <p>
                            3.
                            账户的注册信息是由用户向本网站提交的，尽管本网站对开通和使用本网站服务的用户进行实名认证，但受限于目前实名认证手段的局限性和潜在漏洞，本网站无法保证该信息之准确、完整，因此用户应对自己的判断承担全部责任。
                        </p>
                        <p>
                            4.
                            如用户选择使用本网站的合作单位所提供的产品或服务，该产品或服务的品质及内容由该合作单位自行负责。
                        </p>
                        <p>
                            5.
                            由于 GPS定位误差导致定位错误或定位不能，联合信任免责。
                        </p>
                        <p>6.除本协议另有规定外，在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过向用户收取的当次服务费用总额。
                        </p>
                        <p>7.用户充分知晓，本网站有权同时为用户及用户交易的相对方提供服务，用户同意对本网站可能存在的该等行为予以明确豁免，并不得以此来主张本网站在提供本服务时存在法律上的瑕疵。
                        </p>
                        <p>8.为有效提供服务，本网站系统将不时进行维护和检测，因此产生的服务中断或不稳定状态，联合信任不承担损害赔偿责任。
                        </p>
                        <p>9.因国家相关主管部门颁布、变更的法令、政策导致本网站不能提供约定服务的，联合信任不承担任何责任，但将根据相关的法令、政策变更、取消、增加本网站的服务内容和本协议。
                        </p>
                        <p>10.因通信公司有线或无线通信系统、设备的检修、维护或不稳定，或黑客攻击，或电力部门技术调整或故障，或银行方面的问题等原因，导致本网站服务中断或不稳定，联合信任不承担损害赔偿责任，但本网站将在2小时内反应，并尽商业上的最大努力争取尽快恢复正常服务。
                        </p>
                        <p>11.因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本网站无法提供服务的，联合信任不承担任何责任。
                        </p>
                        <p>12.因提供本网站服务所使用的网络、系统、其他软件本身的固有缺陷、运行错误而给用户造成的任何直接或间接损失（包括但不限于数据丢失、利润损失、丧失商业机会等），联合信任不承担赔偿责任。
                        </p>
                        <p>13.本网站对甲方因其帐号、密码、需要认证的文件等遗失、被盗、被误用或被擅自修改、计算机设备故障、操作失误等情况造成的损失不负责任，但由于联合信任原因造成的除外。
                        </p>
                    </div>
                    <h2>七、 法律适用及管辖</h2>
                    <div class="section">
                        <p>
                            1.
                            本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用中华人民共和国法律。如与本协议有关的某一特定事项没有法律规定或规定不明确，则应参照通用的国际商业惯例和行业惯例。
                        </p>
                        <p>
                            2.
                            如因本协议或本网站服务所引起或与其有关的任何争议应向联合信任所在地人民法院起诉。
                        </p>
                    </div>
                    <h2>八、 其他</h2>
                    <div class="section">
                        <p>
                            1.
                            本网站内容可能涉及由第三方所有、控制或运营的其它网站（以下称“第三方网站”）。本网站不能保证也没有义务保证第三方网站上信息的真实性和有效性。用户应按照第三方网站的相关协议与规则使用第三方网站，而不是按照本协议。第三方网站的内容、产品、广告和其他任何信息均由用户自行判断并承担风险，而与本网站无关。
                        </p>
                        <p>
                            2.
                            用户在同意、接受本协议前应充分阅读、接受并同意《隐私保护协议》的全部规定。本协议自用户同意勾选并成功注册为本网站用户之日起生效，除非本网站终止本协议或者用户注销账户，否则本协议始终有效。本协议终止并不免除用户根据本协议或其他有关协议、规则已经产生的义务和责任。
                        </p>
                        <p>
                            3.
                            用户利用本网站或本网站服务从事任何不符合中国法律法规、违反本协议或本网站其他规则、侵犯他人权益的活动，使第三方向联合信任及其代理人提出赔偿请求（包括司法费用和其他专业人士的费用），如联合信任及其代理人承担了赔偿责任即获得了向该用户追偿的权利，该用户应承担全部赔偿费用以使联合信任及其代理人免遭损失。
                        </p>
                        <p>
                            4.
                            本协议中的任何条款完全或部分无效或不具有执行力，不影响本协议的其余条款的效力。
                        </p>
                        <p>
                            5.
                            本协议的标题仅为方便而设，在解释本协议时应被忽略。
                        </p>
                        <p>
                            6. 联合信任对本协议享有最终的解释权。
                        </p>
                        <p>
                            7. 本协议以中文版本为准据，日文版本为参考。
                        </p>
                    </div>
                </div>
                <div v-else class="cnt-lan japan">
                    <h1>ユーザー登録及び利用規約</h1>
                    <div class="section">
                        トラステッド・タイムスタンプは、北京聯合信任技術服務有限公司（以下、「聯合信任」）により運営される。本ユーザー登録及び利用規約（以下、「本規約」）は、規約の効力を有し、両当事者は、聯合信任とトラステッド・タイムスタンプの登録ユーザー（以下、「ユーザー」）であり、トラステッド・タイムスタンプでの登録ユーザーのすべての行為に適用される。
                    </div>
                    <div class="section">
                        トラステッド・タイムスタンプの登録ユーザーになる前に、本規約のすべての内容を十分に閲読し本規約の内容に同意又は理解しない場合は、後続の操作を行わないこととする。
                    </div>
                    <div class="section">
                        トラステッド・タイムスタンプのすべての登録操作が完了すると、トラステッド・タイムスタンプの登録ユーザーになり、これは、ユーザーが本規約のすべての内容を十分に閲読して理解し、順守することに同意したことを示す（ユーザーは、本規約の内容を読んでいないなどの理由で、本規約が無効であることを主張したり取り消しを要求したりしてはならない）。また、ユーザーは、中国の法律、法規、規制及びその他の政府規範性文書による規定を順守することを承諾し、違反した場合は、対応するすべての法的責任を独自に負う。
                    </div>
                    <h2>一、 声明及び告知</h2>
                    <div class="section">
                        <p>
                            <b>1. </b
                            >本規約の内容には、以下のすべての条項、及びトラステッド・タイムスタンプで公開されているユーザー関連規則、将来リリースされ得るユーザー関連規則が含まれ、これらの規則は、本規約と同等の法的効力を有する。
                        </p>
                        <p>
                            <b>2. </b
                            >トラステッド・タイムスタンプは、経営側のニーズに応じて本規約の内容を変更する権利を有する。本規約の条項又はトラステッド・タイムスタンプの各規約に何らかの変更がある場合、トラステッド・タイムスタンプはウェブサイトに告知を掲載する。改定された関連条項及び規則は告知されると、告知において指定された特定の発効日に自動的に効力が発生する。ユーザーは、トラステッド・タイムスタンプの関連条項及び規則に関する告知に適時注意する必要があり、これらの変更に同意しない場合、変更の告知日から７２時間以内に、トラステッド・タイムスタンプに登録する際に提供した個人用電子メールを用いて、トラステッド・タイムスタンプのサービスメールアドレス—【】—へ本規約を終了したいことを明確に表す「ユーザー登録取消申請」のメールを送信し、トラステッド・タイムスタンプは、ユーザーからのメールの受信を確認した後、本規約の終了及び終了後の両当事者の権利と義務の履行についてユーザーと協議する。ユーザーが本条項に記載された期限内に登録終了申請を送信しない場合、本条項に記載された期限と同時に、ユーザーはそのような変更を受け入れることに同意したものとみなされ、改定された関連条項及び規則は告知されると、告知に指定された特定の発効日に自動的に効力が発生する。
                        </p>
                        <p>
                            <b>3. </b
                            >聯合信任はトラステッド・タイムスタンプの関連するサービスの一部機能の提供を中止、終了又は制限したり、新しい機能を提供したりする権利があり、任意の機能に減少、追加又は変更が発生する場合にも、ユーザーがまだ本サービスを利用している限り、ユーザーは本規約又は変更した規約に同意するものとする。
                        </p>
                        <p>
                            <b>4. </b
                            >本規約は、トラステッド・タイムスタンプの使用に起因するトラステッド・タイムスタンプの登録ユーザー間の法的関係及び法的紛争に関与しない。
                        </p>
                        <p>
                            <b>5. </b
                            >聯合信任は、ユーザーによるトラステッド・タイムスタンプの使用を中止、終了又は制限する権利を留保するが、そのような終了、中止又は制限により、ユーザーがトラステッド・タイムスタンプを以前に合法的に使用したことによって生成されたデータが無効になる又は削除されるとは限らない。
                        </p>
                        <p>
                            <b>6. </b
                            >ユーザーは、自身のアカウントやパスワードなどのアカウント情報を適切に保管するものとし、アカウントやパスワードなどのアカウント情報の盗難やその他の理由によりトラステッド・タイムスタンプでのいかなる操作も拒否してはならない。
                        </p>
                        <p>
                            <b>7. </b
                            >聯合信任は、テキスト、写真、ソフトウェア、オーディオ、ビデオ、データ、ソースコード、デザインを含むがこれらに限定されない、トラステッド・タイムスタンプ上のすべての非パブリックドメイン又は他人により独占されていない情報内容に対する知的財産権（商標権、特許権、著作権を含むが、これらに限定されない）を保有し、聯合信任の書面による許可なしに、聯合信任に属する情報内容をコピー、印刷、及び配布してほかの用途に用いることを禁止する。
                        </p>
                        <p>
                            <b>8. </b
                            >聯合信任は、トラステッド・タイムスタンプ上のすべての製品、技術及びプログラムに対して知的財産権を有し、聯合信任の書面による許可なしに使用すること（違法な方式による印刷、コピー、配布、表示、ダウンロードなどを含むが、これらに限定されない）を禁止する。
                        </p>
                    </div>
                    <h2>二、 用語説明</h2>
                    <div class="section">
                        <p>
                            1.
                            アカウント：聯合信任がユーザーに提供する電子情報スペースであり、ユーザーは、トラステッド・タイムスタンプに専用のアカウントを有する。ユーザーは、自身でアカウントのパスワードを設定し、それを使用してトラステッド・タイムスタンプで提供されるサービスを照会又は使用することができる。ユーザーは、自身の電子メールアドレス又は携帯電話番号、又は当社で許可されている他の方式でアカウントにログインする必要がある。
                        </p>
                        <p>
                            2.
                            トラステッド・タイムスタンプ：本規約に別段規定がない限り、ｊｐ．ｔｓａ．ｃｎを指す。
                        </p>
                        <p>
                            3.
                            タイムスタンプ：聯合信任タイムスタンプサービスセンター（ＴＳＡ：Ｔｉｍｅ　Ｓｔａｍｐ　Ａｕｔｈｏｒｉｔｙ）によって発行された、電子データについて認証を申請する時間と内容の完全性を証明するための、法的効力を有する電子証明書である。
                        </p>
                        <p>
                            4.
                            タイムスタンプ認証：ユーザーは、トラステッド・タイムスタンプ（Trusted
                            Time
                            Stamp）認証を申請するとき、電子データのハッシュ値（Ｈａｓｈ）をアップロードするだけでよい。トラステッド・タイムスタンプは、受信した電子データのハッシュ値（Ｈａｓｈ）を信頼できるタイムソース（国家授時センターにより時間付与と時間厳守を行い、つまり、一旦、電子データがタイムスタンプ認証を申請したら、申請時間は変更できない）にバインドし、これに加えて、聯合信任の秘密鍵で署名して、偽造不可能なタイムスタンプファイル（拡張子．ｔｓａのファイル）を生成する。
                        </p>
                        <p>
                            5.
                            タイムスタンプ検証：ユーザーが電子データに対してタイムスタンプ検証を実行するとき、電子データを対応するタイムスタンプファイル（電子データのハッシュ値と信頼できる時刻を含む）と技術的に比較することにより、電子データの生成時刻、及び生成時刻から内容が完全性を保持して変更されていないか否かを効果的に確認することができる。
                        </p>
                        <p>
                            6.
                            ｅシール：電子署名の１つの形式の実現ツールであり、画像処理技術を使用して電子署名操作を紙文書の捺印操作と同じ視覚的効果に変換する。
                        </p>
                        <p>
                            7.
                            デジタル証明書：公開キーの所有者の情報（すなわち、名称及び認証局によるデジタル署名）と公開キーを含む、認証局によってデジタル署名されたファイルである。デジタル証明書は特定の期間にのみ有効である。また、第三者のデジタル証明書とトラステッド・タイムスタンプ（Trusted
                            Time
                            Stamp）を統合することで、信頼できる電子署名を実現し、電子情報の信頼性と完全性及び署名者の否認不可性を保証することができる。
                        </p>
                        <p>
                            8.
                            電子証拠固化：プラットフォームによって生成された電子データに、聯合信任タイムスタンプサービスセンター（ＴＳＡ：Ｔｉｍｅ　Ｓｔａｍｐ　Ａｕｔｈｏｒｉｔｙ）によって発行されたタイムスタンプがすぐにスタンプされ、該データが『電子署名法』の第２章第５条に記載のデータメッセージの原本の形式についての規定を満たすようにする。
                        </p>
                        <p>
                            9.
                            ＧＰＳ測位システム：衛星を使用して全世界の範囲でリアルタイムな測位とナビゲーションを実行するシステムであり、単にＧＰＳ（Ｇｌｏｂａｌ　Ｐｏｓｉｔｉｏｎｉｎｇ　Ｓｙｓｔｅｍ）と呼ばれる。
                        </p>
                        <p>
                            10.
                            ＧＰＳ測位誤差：地上受信装置を介して衛星から送信された情報を受信し、地上受信装置と複数の衛星との間の擬似距離を同時に計算し、空間距離後方交会法を使用して地上点の３次元座標を決定する。ＧＰＳ衛星、衛星信号の伝搬プロセス及び地上受信装置のいずれによってもＧＰＳ測位誤差が生じ得る。
                        </p>
                    </div>
                    <h2>三、 サービス内容及びサービス費用</h2>
                    <div class="section">
                        <p>
                            1.
                            トラステッド・タイムスタンプで提供されるサービスには、以下が含まれる:
                        </p>
                        <div class="section-child">
                            <p>
                                1) トラステッド・タイムスタンプ（Trusted Time
                                Stamp）：聯合信任は、ＲＦＣ３１６１標準に合致したトラステッド・タイムスタンプ（Trusted
                                Time
                                Stamp）をさまざまな業界に提供し、ＡＰＩインターフェイスを外部に公開し、すべてのタイプのアプリケーションシステムは、標準に準拠している限り、トラステッド・タイムスタンプにアクセスしてサービスを取得できる。
                            </p>
                            <p>
                                2)
                                信頼できる電子署名（電子規約）サービス：実名認証、規約署名、規約管理、署名リマインダーなどの機能を含む従来の紙媒体による規約の署名の電子化を実現し、ユーザーのニーズに応じて電子規約締結のさまざまな実行方式を実現できる。
                            </p>
                            <p>
                                3)
                                知的財産権保護サービス：文学、芸術、自然科学、社会科学、エンジニアリングなどのさまざまな作品に対してトラステッド・タイムスタンプ（Trusted
                                Time
                                Stamp）認証を行い、認証対象となる知的財産権（電子データ、文書）に対して、誰（ｗｈｏ）が何時（ｗｈｅｎ）どのような作品（ｗｈａｔ）を保有するかを証明する。
                            </p>
                            <p>
                                4)
                                電子証拠固定化及び保存サービス：証拠を速やかに固定して、証拠の破壊や紛失を防ぎ、客観的かつ真実に即して事実を復元する。
                            </p>
                            <p>
                                5)
                                ユーザーの委託を受けてユーザーに提供するその他のサービス。
                            </p>
                        </div>
                        <p>
                            2.
                            トラステッド・タイムスタンプで提供されるサービスを使用するユーザーは、個別に開始操作を完了し、関連するサービス規則を遵守する必要がある。
                        </p>
                        <p>
                            3.
                            ユーザーがトラステッド・タイムスタンプで提供されるサービスを使用する場合、聯合信任は、対応するサービス料金をユーザーに請求する権利を有する。聯合信任は、日本技術貿易株式会社が運営するトラステッド・タイムスタンプ（Trusted
                            Time
                            Stamp）の知的財産権保護システムの日本語版を日本で独占的販売代理して、ユーザーにサービス料を課することを許可する。各サービスの具体的な料金については、トラステッド・タイムスタンプで公開されているカスタマーサービスに直接連絡するか、トラステッド・タイムスタンプで公開されているサービス価格及び関連規則を参照することとする。ユーザーは、日本技術貿易株式会社と締結した規約に基づいて関連するサービス料金を支払うものとし、ユーザーが規約に従って料金を支払わなかった場合、聯合信任は、ユーザーによる聯合信任サービスのさらなる使用を停止する権利を有する。
                        </p>
                        <p>
                            4.
                            聯合信任は、さまざまなサービスの料金を独自に策定及び調整する権利を有し、料金の調整規則は、トラステッド・タイムスタンプでの告知を基準にする。
                        </p>
                    </div>
                    <h2>四、 登録及び取り消し</h2>
                    <div class="section">
                        <p>
                            1.
                            登録ユーザーには、ビジネスユーザーと個人ユーザーが含まれる。企業ユーザーは、日本で設立され独立して民事責任を負うことができる法人及びその他の組織である。個人ユーザーは、日本の法律による完全民事行為能力を有し独立して民事責任を負うことができる日本人である（例外として、トラステッド・タイムスタンプの一部の機能は、日本の法律に規定される未成年者にサービスを提供できるが、個別に申請して登録を完了する必要がある。）。
                        </p>
                        <p>
                            2.
                            個人及び企業は、トラステッド・タイムスタンプにおいて登録を完了すると登録ユーザーになり、登録ユーザーになった後は、実名認証が必要であり、実名認証に成功した場合、トラステッド・タイムスタンプでサービスを利用する権利を有する。
                        </p>
                        <p>
                            3.
                            登録、実名認証、及びトラステッド・タイムスタンプのサービス使用のすべての期間にわたって、ユーザーは、真の資料と情報を提供し、登録日からトラステッド・タイムスタンプのサービスを使用するすべての期間にわたって、提出したすべての資料と情報が真実、正確、完全かつ最新であることを確保する。実名認証方式によっては、個人が提供する必要がある実名認証資料が異なり、詳細については、トラステッド・タイムスタンプの要件を基準にする。
                        </p>
                        <p>
                            4.
                            中国の法律法規、部門の規制又は規制機関の要件により、トラステッド・タイムスタンプがユーザーに任意の関連資料を付加的に提供することを要求する場合、ユーザーが速やかに協力して提供できないと、トラステッド・タイムスタンプはユーザーへの一部又はすべてのサービスの提供を中止又は終了する権利があり、それに起因する損失については、聯合信任は責任を一切負わない。
                        </p>
                        <p>
                            5.
                            ユーザーは、アカウントを使用しないことを決定した場合、該アカウント内の使用可能なデータをエクスポート又は削除し、トラステッド・タイムスタンプに指定された手順に従ってトラステッド・タイムスタンプにアカウントの取り消しを申請する必要があり、その手順を履行しない場合、アカウントの取り消しによるデータ損失についての責任は、ユーザー自身が負う。異常なアカウント（中止状態のアカウント）の場合は、取り消す前にプロンプトに従って操作して正常に回復する必要がある。アカウントを取り消すと本規約は自動的に終了し、トラステッド・タイムスタンプは、アカウント内のすべてのデータを回復不能に削除するか、アカウント内の関連情報を保持するかを選択する権利があり、削除されたアカウント内のデータに基づくいかなる未解決の権利と義務も、聯合信任とは関係を有さない。
                        </p>
                        <p>
                            6.
                            ユーザーによるアカウントの取り消し申請が成功すると、回復することはできず、サービスを再度使用する必要がある場合は、再度登録する必要がある。
                        </p>
                        <p>
                            7.
                            ユーザーが連続して２４か月間、トラステッド・タイムスタンプの登録アカウントにログインしておらず、且つ本トラステッド・タイムスタンプに保留される資産がなく、又はトラステッド・タイムスタンプにおいて保留データ又はサービス使用の痕跡がない場合、当社はユーザーの登録アカウントを通知なしに取り消す権利があることを、ユーザーは理解して同意する。
                        </p>
                    </div>
                    <h2>五、 使用及び使用制限</h2>
                    <div class="section">
                        <p>
                            1.
                            ユーザーがトラステッド・タイムスタンプに提供した各情報と資料が変更された場合、聯合信任はトラステッド・タイムスタンプにおいて対応する情報と資料を速やかに更新する。ユーザーが情報と資料を速やかに更新しないことによりトラステッド・タイムスタンプがユーザーにサービスを提供できない場合、又はエラーが発生した場合、ユーザーは、前記の各事由に起因する結果及びすべての法的責任を負担する。
                        </p>
                        <p>
                            2.
                            コンピュータ、携帯電話及びその他の電子機器のユーザーの使用習慣に基づいて、トラステッド・タイムスタンプは、ユーザーが特定の製品を使用するときに、同じ又は異なるアカウントログインモードを設定し、さまざまな手段でユーザーのＩＤを識別し、同じＩＤを持つユーザーを同じアカウントに分類して管理する権利を有する。
                        </p>
                        <p>
                            3.
                            トラステッド・タイムスタンプサービスを使用するとき、ユーザーは本規約又はウェブサイトの説明ページに記載の操作のヒント及び規則に従うものとし、そうでない場合、サービスを使用する目的を達成できない場合にユーザー自身の責任となる。
                        </p>
                        <p>
                            4.
                            ユーザーは、トラステッド・タイムスタンプでのログイン状態を終了するとき、正しい手順でアカウントからログアウトするものとする。ユーザーが本条項の規定を順守しなかったことにより生じた損失及び不利な結果は、ユーザーが負担する。
                        </p>
                        <p>
                            5.
                            ユーザーは、他者が自身のアカウントとパスワードを無断使用又は盗用した状況、又は他の不正な状況、アカウントに関連付けられた携帯電話又は他のデバイスの紛失、又はアカウントのセキュリティを危険にさらす可能性のある他の状況を見つけた場合、直ちに有効な方式でトラステッド・タイムスタンプに通知して、関連サービスの中止をトラステッド・タイムスタンプに申請するものとする。ユーザーによる関連サービスの中止申請又は他のアクションを実行するには合理的な期間が必要であり、それまでに、トラステッド・タイムスタンプで既に実行された指令及び／又はその実行によって生じた損失については、ユーザーが責任を負担する。
                        </p>
                        <p>
                            6.
                            ユーザーが他人の情報と文書を使用してトラステッド・タイムスタンプに登録してサービスを使用した場合、又はトラステッド・タイムスタンプに提供される情報と資料が関連する登録規定を満たさないことにより生じた結果、トラステッド・タイムスタンプ及び他のユーザーが被った損失について、ユーザーは賠償する責任を負い、聯合信任は賠償責任を負わない。
                        </p>
                        <p>
                            7.
                            ユーザーは、トラステッド・タイムスタンプ又はトラステッド・タイムスタンプサービスを使用して、中国の法律法規に合致しない、本規約又はトラステッド・タイムスタンプのその他の規則に違反する、他者の権利と利益を侵害する活動に従事してはならない。聯合信任は、ユーザーがそのような活動に従事していることを発見した場合、聯合信任は、ユーザーのトラステッド・タイムスタンプの機能のすべて又は一部の使用を通知なしに直ちに中止又は終了する権利を有する。
                        </p>
                        <p>
                            8.
                            トラステッド・タイムスタンプで提供されるサービス（内部メッセージサービス、グループサービス、フォーラムサービス、又はその他のメール転送サービスを含むが、これらに限定されない）を使用する過程で、ユーザーは、スパム又は中国の法律法規及び本規約の内容に違反する可能性のある情報を送信、公開又は表示してはならない。トラステッド・タイムスタンプは、ユーザーがそのような活動に従事している、又はそのような内容を公開していることを発見した場合、ユーザーの同意なしにそのような活動を阻止してこのような内容を削除する権利を有し、同時に、通知なしにユーザーによるトラステッド・タイムスタンプの一部又はすべての機能の使用を直ちに中止又は終了する権利を有する。
                        </p>
                        <p>
                            9.
                            聯合信任は、本規約、法律諸法規、法律文章の規定及び関連機関の要求によりアカウント操作に異常又はリスクがあると合理的な判断に基づき考える場合、又はユーザーが第三者からクレームを申し立てられている証拠も若しくはこれに限定されない事実がある場合、ユーザーによるウェブサイトのすべて又は一部の機能の使用を中止又は終了する権利を有するものとし、ユーザーはこれに同意する。
                            　前記の状況によりトラステッド・タイムスタンプの機能のすべて又は一部の使用の中止又は終了した場合、聯合信任は、ユーザーに対し、直ちに通知する。
                            　アカウントの利用を中止されたユーザーがサービスを再開する場合は、当該ユーザーは、聯合信任から通知された特定の要件に従い関連する情報、資料及び説明などの文書を提出して申請し、聯合信任はその再開申請に同意するか否かを自ら決定できるものとする。
                        </p>
                        <p>
                            10.
                            ユーザーによるトラステッド・タイムスタンプのすべて又は一部の機能の使用を中止することは、すなわちアカウントの中止であり、アカウントの中止後も、トラステッド・タイムスタンプはアカウント内のすべての関連資料を保持し、関連する文書内容の証明を照会してユーザーに提供できる。
                        </p>
                        <p>
                            11.
                            ユーザーによるトラステッド・タイムスタンプのすべての機能の使用を終了すると、アカウントが取り消され、それによって生じるすべての結果は、ユーザーが負担する（アカウント内のデータの削除、ユーザーのために関連文書内容の証明を照会してユーザーに提供できないことを含むがこれらに限定されない）。
                        </p>
                        <p>
                            12.
                            ユーザーが登録時にトラステッド・タイムスタンプに登録した電話番号、電子メールアドレス、ユーザー名、パスワード、及び支払いセキュリティパスワードは、トラステッド・タイムスタンプでのユーザーの一意の識別情報である。ユーザーが登録に成功した後、登録用の電話番号、電子メールアドレス、ユーザー名、パスワード、及び支払いセキュリティパスワードは、本規約で別段の合意がない限り、第三者に譲渡又は使用許可してはならない。ユーザー名とパスワードを使用してトラステッド・タイムスタンプにログインした後にトラステッド・タイムスタンプで行うすべての操作及びトラステッド・タイムスタンプに登録するときにユーザーが提出した個人用電子メールアドレスからの電子メール送信は、ユーザー自身を表し、ユーザーは対応する法的結果を負う。トラステッド・タイムスタンプは、ユーザーの操作によって出された指示に従って直ちに実行し、トラステッド・タイムスタンプが撤回機能を有するもの以外、取り消し又は撤回不能である。
                        </p>
                        <p>
                            13.
                            アカウント内のデータはトラステッド・タイムスタンプの記録を基準にし、ユーザーがこれらのデータに異議がある場合、ユーザーのアカウントデータの変更日から７２時間以内に当社に異議を申し立て、聯合信任が確認するための関連証拠を提出し、そうしない場合、ユーザーが該当データを承認したとみなされることを、ユーザーは承認する。
                        </p>
                    </div>
                    <h2>六、 通知及び送達</h2>
                    <div class="section">
                        <p>
                            1.
                            本規約に基づく通知が公示の形で行われた場合、トラステッド・タイムスタンプで公示されると、送達されたとみなされる。
                        </p>
                        <p>
                            2.
                            また、ユーザー個人に送達されたその他の特定の通知は、トラステッド・タイムスタンプにユーザー登録時に変更したメールアドレス又は登録時に変更したメールアドレス又は登録後にユーザー情報を変更したときに提供したメールアドレス、又はトラステッド・タイムスタンプにユーザーのために個人アカウントの「ユーザーメッセージ」に提供され送信された時に送達されたとみなされる（聯合信任は、ユーザーが通知を受信したか、又は速やかに受信したか否かについて責任を負わない）。
                        </p>
                        <p>
                            3.
                            ユーザーは、ユーザーのメールアドレス、「ユーザーメッセージ」に含まれるメール情報に注意を払うことを約束し、メッセージがトラステッド・タイムスタンプから送信されると、ユーザーに通知したとみなされ、ユーザーは、いかなる理由によっても本規約の変更後の効力を否認したり関連義務の履行を拒否したりすることができない。
                        </p>
                    </div>
                    <h2>七、 責任制限及び免責条項</h2>
                    <div class="section">
                        <p>
                            1.
                            聯合信任は、本規約で明示的に合意された責任のみを負う。
                        </p>
                        <p>
                            2.
                            トラステッド・タイムスタンプが提供するサービスに基づいて形成された取引に起因するリスクは、ユーザー及び取引先が負担するものとし、トラステッド・タイムスタンプは、これについていかなる形式の保証も提供しない。
                        </p>
                        <p>
                            3.
                            アカウントの登録情報はユーザーによりトラステッド・タイムスタンプに登録されるものであり、トラステッド・タイムスタンプは、トラステッド・タイムスタンプのサービスを使用したユーザーに対して実名認証を実行するが、現在の実名認証手段の限界性及び潜在的な脆弱性によって制限されるため、この情報の正確性及び完全性を保証できないため、ユーザーは自身の判断について全責任を負うものとする。
                        </p>
                        <p>
                            4.
                            ユーザーが聯合信任の協力機関により提供される製品又はサービスの使用を選択した場合、該製品又はサービスの品質と内容は、該協力機関の責任になる。
                        </p>
                        <p>
                            5.
                            聯合信任は、ＧＰＳ測位誤差により測位エラーや測位不能が生じた場合、免責される。
                        </p>
                        <p>
                            6.
                            本規約に別段の規定がない限り、いずれの場合も、聯合信任が本規約に違反したことによる損害賠償額の上限は、ユーザーに課金される当該サービス料金の総額とする。
                        </p>
                        <p>
                            7.
                            ユーザーは、トラステッド・タイムスタンプがユーザーとユーザーの取引先の双方にサービスを提供するものであるところ、ユーザーは聯合信任及び代理店に対し、トラステッド・タイムスタンプで提供するサービスに法的欠陥があることを放棄し、聯合信任が免責されることに同意する。
                        </p>
                        <p>
                            8.
                            サービスを効果的に提供するために、トラステッド・タイムスタンプのシステムは、随時メンテナンス及び検査を行うため、それによって引き起こされるサービスの中断又は不安定的な状態に対して、聯合信任は、損害賠償責任を負わない。
                        </p>
                        <p>
                            9.
                            中国の関連管理機関によって公布又は変更された法令、政策によりトラステッド・タイムスタンプが規約サービスを提供できない場合、聯合信任は一切責任を負わないが、関連する法令、政策に従って、トラステッド・タイムスタンプのサービス内容及び本規約を変更、キャンセル、追加する。
                        </p>
                        <p>
                            10.
                            通信会社の有線又は無線通信システム及び機器の検査、メンテナンス又は不安定性、ハッキング攻撃、電力機関の技術的調整又は故障、又は銀行の問題などにより、トラステッド・タイムスタンプのサービスが中断される又は不安定になる場合、聯合信任は、損害賠償責任を負わないが、聯合信任は、２時間以内に対応し、できるだけ早く通常のサービスを再開するために商業的に最大限の努力を払う。
                        </p>
                        <p>
                            11.
                            台風、地震、津波、洪水、停電、戦争、テロ攻撃などの不可抗力の要因により、トラステッド・タイムスタンプがサービスを提供できない場合、聯合信任は一切の責任を負わない。
                        </p>
                        <p>
                            12.
                            トラステッド・タイムスタンプでサービスを提供するために使用されるネットワーク、システム、及びその他のソフトウェアの固有の欠陥及び運転エラーによりユーザーに引き起こされる直接的又は間接的な損失（データロス、利益の損失、ビジネスチャンスの損失などを含むが、これらに限定されない）については、聯合信任は賠償責任を負わない。
                        </p>
                        <p>
                            13.
                            トラステッド・タイムスタンプは、アカウント、パスワード、及び認証を必要とする文書の紛失、盗難、悪用、又は不正な変更、コンピュータ機器の故障、操作エラーなどによるユーザーの損失について、聯合信任は責任を負わないが、聯合信任による原因の場合を除く。
                        </p>
                    </div>
                    <h2>八、 法律適用及び管轄</h2>
                    <div class="section">
                        <p>
                            1.
                            本規約の締結、修正、実施、解釈、及び本規約に関連する紛争の解決には、中華人民共和国の法律を適用するものとする。本規約に関連する特定事項について法律の規定がない又は規定が不明確である場合、一般的な国際商慣行及び業界慣行を参照するものとする。
                        </p>
                        <p>
                            2.
                            本規約又はトラステッド・タイムスタンプのサービスに起因する又はこれらに関連する紛争は、聯合信任が所在する人民法院に提起する。
                        </p>
                    </div>
                    <h2>九、 その他</h2>
                    <div class="section">
                        <p>
                            1.
                            トラステッド・タイムスタンプの内容には、第三者が所有、管理、又は運営している他のウェブサイト（以下、「第三者のウェブサイト」）が含まれる場合がある。トラステッド・タイムスタンプは、第三者のウェブサイト上の情報の信憑性と有効性を保証することはできず、また、保証する義務はない。ユーザーは、本規約ではなく、第三者のウェブサイトの関連規約及び規則に従って第三者のウェブサイトを使用するものとする。第三者のウェブサイトの内容、製品、広告、及びその他のいかなる情報も、すべてユーザー自身で判断してリスクを負い、トラステッド・タイムスタンプとは関係を有さない。
                        </p>
                        <p>
                            2.
                            ユーザーは、本規約に同意して承認する前に、「プライバシー保護規約」のすべての規定を十分に閲読して承認、同意するものとする。本規約は、ユーザーが同意してトラステッド・タイムスタンプのユーザーとして正常に登録した日から発効し、聯合信任が本規約を終了しない限り又はユーザーがアカウントを取り消さない限り、本規約は常に有効である。本規約が終了しても、本規約又は他の関連する規約、規則に基づき生じたユーザーの義務と責任は免除されない。
                        </p>
                        <p>
                            3.
                            ユーザーがトラステッド・タイムスタンプ又はトラステッド・タイムスタンプサービスを使用して、中国の法律法規に合致しない、本規約又はトラステッド・タイムスタンプの他の規則に違反する、他者の権利と利益を侵害する活動に従事することによって、第三者が聯合信任及びその代理店に対して賠償クレーム（司法費用及びその他の専門家費用を含む）を申し立てた場合、聯合信任及びその代理店は、賠償責任を負うことで当該ユーザーに賠償を要求する権利を得て、当該ユーザーは、聯合信任及び代理店が損失を受けないように、すべての賠償費用を負担するものとする。
                        </p>
                        <p>
                            4.
                            本規約の条項が完全に又は部分的に無効となる又は執行力がなくなる場合も、本規約の残りの条項の効力には影響しない。
                        </p>
                        <p>
                            5.
                            本規約のタイトルは便宜上のものであり、本規約を解釈するときに無視すべきである。
                        </p>
                        <p>
                            6. 聯合信任は、本規約に対して最終解釈権がある。
                        </p>
                        <p>
                            7.
                            本規約は、中国語版を基準とし、日本語版を参考訳とする。
                        </p>
                    </div>
                </div>
            </div>
            <div class="footer">
                <div class="check">
                    <el-checkbox v-model="agreement" @change="read()">
                    </el-checkbox>
                    <span>
                        ユーザー登録及び利用規約の内容を理解した上で同意します</span
                    >
                </div>
                
                <el-button
                    :disabled="btndisabled"
                    type="primary"
                    @click="nexttwo()"
                    >次へ</el-button
                >
                <el-button style="margin-right:15px;" @click="childMethod">取消</el-button>
            </div>
        </el-dialog>
    </div>
</template>

<script>
export default {
    name: "Argeement",
    data() {
        return {
            xieyi: false,
            agreement: false,
            btndisabled: true,
            Language: 1
        };
    },
    props: ["show1","fatherMethod"],
    components: {},

    computed: {},

    created() {
        //console.log(this.first)
        if (this.show1) {
            this.xieyi = true;
        }
    },

    mounted() {},

    methods: {
        childMethod(){
            if (this.fatherMethod) {
                this.fatherMethod();
            }
        },
        read() {
            this.btndisabled = !this.agreement;
        },
        tag(e) {
            if (e == 1) {
                this.Language = 1;
            } else {
                this.Language = 2;
            }
        },
        nexttwo() {
            this.$emit("show", 2);
            this.xieyi = false;
        }
    }
};
</script>
<style scoped>
.Language {
    text-align: right;
}
.Language span {
    display: inline-block;
    width: 68px;
    height: 30px;
    line-height: 30px;
    text-align: center;
    margin: 0 10px;
    background: #f3f3f3;
    color: #000;
    border-radius: 30px;
    cursor: pointer;
}
.Language span.curLan {
    color: #fff;
    background: #6a91f0;
}
.cnt {
    margin-top: 20px;
    padding: 20px;
    font-size: 16px;
    line-height: 30px;
    height: 40vh;
    overflow: auto;
}
.chinese {
    font-family: "Arial", "微软雅黑", "宋体";
}
.cnt h1 {
    font-size: 16px;
    font-weight: bold;
    text-align: center;
}
.section {
    text-indent: 2em;
}
.section-child {
    text-indent: 2em;
    padding-left: 30px;
}
.footer {
    margin-top: 20px;
    overflow: hidden;
}
.footer .el-button {
    float: right;
}
.footer span {
    vertical-align: middle;
}
.check {
    float: left;
    line-height: 40px;
    color: #999;
}
</style>
<style lang="stylus">
.argeement .el-dialog__body{
    padding:20px;
}
</style>
