<template>
    <div class="privacy">
        <el-dialog
            title="個人情報保護規約"
            :visible.sync="xieyi"
            width="80%"
            :modal-append-to-body="false"
            top="10vh"
            :showClose="false"
            :close-on-click-modal="false"
        >
            <div class="Language">
                <span @click="tag(1)" :class="Language == 1 ? 'curLan' : ''"
                    >中国語</span
                >
                <span @click="tag(2)" :class="Language == 2 ? 'curLan' : ''"
                    >日本語</span
                >
            </div>
            <div class="cnt">
                <div v-if="Language == 1" class="cnt-lan chinese">
                    <h1>隐私保护协议</h1>
                    <div class="section">
                        本《隐私保护协议》属于《用户注册和使用协议》的有效组成部分，本网站有权根据实际情况的变化和需要以及用户的建议对本《隐私保护协议》进行修订与更新，修订与更新的内容于公布的生效日期生效。
                    </div>
                    <div class="section">
                        本隐私保护协议构成本网站对用户隐私保护的承诺。完成注册即意味着用户接受《用户注册和使用协议》和《隐私保护协议》全部内容。
                    </div>
                    <h2>一、 受保护信息</h2>
                    <div class="section">
                        <p>
                            1.用户向本网站提交的用于注册和使用相关服务的信息、本网站在实名认证或提供服务的过程中时获取的相关信息均属于受保护范围。
                        </p>
                        <p>
                            2.用户应确保提供给本网站的信息的真实性、完整性以及信息更新的及时性，本网站对任何涉及虚假、欺诈的不合法或不符合本网站规则的信息不必然提供保护。
                        </p>
                        <p>
                            3.用户发现其信息已经被泄露或者存在被泄露的可能，且可能会危及到用户在本网站注册账户的安全，或者可能给用户造成其他的损失的，应在第一时间通知本网站，以便本网站采取相应的措施防止损失的发生或者进一步扩大。
                        </p>
                    </div>
                    <h2>二、信息采集授权</h2>
                    <div class="section">
                        <p>
                            用户在使用本网站的服务时，为了更好服务用户、提高服务品质，本网站有权收集用户的相关信息（以下统称“用户信息”）包括但不限于：
                        </p>
                        <p>
                            1.个人、企业、其他组织的相关信息，包括身份证信息、企业证照的相关信息、联系电话、联系地址、实际住所等；
                        </p>
                        <p>
                            2.用户在使用本网站服务过程中提交的、形成的数据信息；
                        </p>
                        <p>3.用户提供给第三方或者向第三方披露的且与用户在本网站注册或使用服务相关的信息及隐私；
                        </p>
                        <p>4.用户登录和使用本网站或子网站的网页、App、小程序、移动网页的时间、时长、支付信息、银行账户信息以及服务使用痕迹和记录；
                        </p>
                        <p>5.用户使用的计算机、移动设备的品牌、型号、IP地址以及软件版本等信息；
                        </p>
                        <p>6.为了实现前述目的，通过 cookie或者其他方式自动采集到的其他信息或者 隐私；
                        </p>
                        <p>
                            7.用户通过具有定位功能的移动设备登录、使用本网站的App 或移动网页时， 本网站有权通过 GPS 或者 Wifi收集用户的地理位置信息；如果不同意收集地理位置信息，应关闭移动设备上的此项功能（但，关闭此项功能有可能导致部分服务无法使用）。
                        </p>
                    </div>
                    <h2>三、信息披露授权</h2>
                    <div class="section">
                        <p>
                            本网站不向任何无关第三方透漏用户信息，但存在下列任何一项情形或者为下述第四条合理使用目的而披露给第三方的除外：
                        </p>
                        <p>1.基于国家法律法规的规定而对外披露；</p>
                        <p>2.应国家司法机关及其他有权机关基于法定程序的要求而披露；
                        </p>
                        <p>3.为保护本网站或用户的合法权益而披露；</p>
                        <p>4.在紧急情况下，为保护其他用户或者第三方人身安全而披露；
                        </p>
                        <p>5.用户本人或其监护人授权披露；</p>
                        <p>6.应用户的监护人的合法要求而向其披露。</p>
                        <p>
                            本网站按照前款约定进行用户信息披露时，将要求数据信息接收方在国家法律法规规定和委托合同约定的范围内使用并保护用户信息。
                        </p>
                    </div>
                    <h2>四、信息合理使用授权</h2>
                    <div class="section">
                        <p>
                            本网站有权将用户提交的和本网站采集到的信息用于包括但不限于下列某一个或者某几个目的，且此目的可以由本网站达成也可以由本网站委托的第三方达成（但第三方行为将受限于本网站与其签署的委托合同，并遵守相关规定）：
                        </p>
                        <p>1.用户登录本网站的网页或者子网站、独立运营的网站、APP、小程序时，用于验证用户的身份、供用户支付费用、为用户提供本网站的相关服务；
                        </p>
                        <p>2.帮助本网站分析、了解用户需求，设计新的商业模式和新产品，向用户及他人推荐新的产品和服务，或者用于本网站开展的新业务；
                        </p>
                        <p>3.评估和改进本网站服务中的产品、服务和其他推广活动效果；
                        </p>
                        <p>4.本网站、子网站、独立运营的网站、APP、小程序的的升级、改版；
                        </p>
                        <p>5.其他的用于改进本网站的服务、提升用户体验的目的。
                        </p>
                        <p>
                            本网站或者接收了本网站委托的第三方企业或者公司发生合并或者分立，那么合并或者分立后企业或者公司仍然有权按照本《隐私保护协议》及其他相关约定采集、披露并保护相关信息，而无须另行征得用户的同意。
                        </p>
                    </div>
                    <h2>五、信息保护措施</h2>
                    <div class="section">
                        <p>1.用户应妥善保管自己的账户密码等账户信息，不得向其他任何人泄露用户的用户名、密码及可以用于密码找回、完成登录等操作的信息，亦不可使用其他任何人的用户名和密码。因用户的保管疏忽等非本网站原因导致账号遭他人非法使用的，本网站不承担任何责任。
                        </p>
                        <p>2.冒用他人账号使用本网站服务、冒用他人信息在本网站注册，本网站有权配合实际权利人或承受损失的一方维护自身权利。
                        </p>
                        <p>3.本网站将会使用各种安全技术和手段保护用户账户及账户内的数据信息，防止其被未经授权的访问、使用、复制和泄露。但用户应该知道并接受“受限于网络技术的发展，不存在绝对安全的保障措施，也无法完全避免信息泄露的风险”，因此非本网站原因导致信息泄露和其他损失，本网站不承担任何责任。
                        </p>
                    </div>
                    <h2>六、保密条款</h2>
                    <div class="section">
                        本网站及用户均需严格遵守保密条款，保护双方商业秘密及相关权益。包括
                        但不限于产品知识产权、策划方案、客户资料、协议合同、技术文档、程序文件、
                        程序控件或源代码、各种账户密码。任何人不得泄漏对方的任何商业秘密，同时
                        不得利用工作之便获取对方技术秘密。对于双方授权使用的技术，只能使用于授
                        权时指定的范围，不得用于它途。
                    </div>
                    <h2>七、第三方网站</h2>
                    <div class="section">
                        本网站含有访问第三方网站的链接，且有权在任何时候增加或减少合作第三方的网站链接。所有第三方网站的隐私保护措施均独立于本网站存在，对此本网站不承担任何责任。
                    </div>
                    <h2>八、赔偿限制</h2>
                    <div class="section">
                        违反本《隐私保护协议》或者本《隐私保护协议》部分条款无效，导致本网站不得不向用户进行赔偿的，那么赔偿的最高金额遵守《用户注册与使用协议》的相关约定，即本公司对所承担的违约赔偿责任总额不超过向用户收取的当次服务费用总额。
                    </div>
                    <h2>九、 其他</h2>
                    <div class="section">
                        <p>1.本《隐私保护协议》是《用户注册与使用协议》不可分割的组成部分，具有同等的法律效力；本《隐私保护协议》与《用户注册与使用协议》不一致或者矛盾的地方，适用本《隐私保护协议》；未涉及的内容，仍适用《用户注册与使用协议》。
                        </p>
                        <p>2.本《隐私保护协议》所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本协议其他条款的法律效力。
                        </p>
                        <p>3.本《隐私保护协议》以中文版本为准据，日文版本为参考。
                        </p>
                    </div>
                </div>
                <div v-else class="cnt-lan japan">
                    <h1>個人情報保護規約</h1>
                    <div class="section">
                        本『個人情報保護規約』は『ユーザー登録及び利用規約』の有効な構成要素である。聯合信任は、実際の状況の変化及びニーズと、ユーザーの提案とに基づいて、本『個人情報保護規約』を修正及び更新する権利を有し、修正及び更新された内容は発行日から効力を生ずるものとする。
                    </div>
                    <div class="section">
                        本個人情報保護規約は、トラステッド・タイムスタンプのユーザー個人情報保護についての承諾である。登録を完了すると、ユーザーは『ユーザー登録及び利用規約』及び『個人情報保護規約』のすべての内容に同意したこととする。
                    </div>
                    <h2>Ⅰ 保護を受ける情報</h2>
                    <div class="section">
                        <p>1.
                            ユーザーがトラステッド・タイムスタンプに登録した情報及び関連サービスの利用のための情報、トラステッド・タイムスタンプが実名認証又はサービス提供の過程で取得した関連情報は、いずれも保護対象とする。
                        </p>
                        <p>
                            2.
                            ユーザーは、トラステッド・タイムスタンプに提供する情報の真実性、完全性及び情報更新の適時性を確保するものとし、聯合信任は、虚偽、詐欺的な違法情報又はトラステッド・タイムスタンプの規則に合致しない情報を必ずしも保護の対象としない。
                        </p>
                        <p>
                            3.
                            ユーザーは、自身の情報が漏洩されたこと又は漏洩される可能性があることを発見し、且つトラステッド・タイムスタンプでユーザーが登録したアカウントのセキュリティに危険を及ぼす可能性がある場合、又はユーザーに他の損失をもたらす可能性がある場合、聯合信任が相応の措置を講じて損失の発生又は拡大を防止することができるように、遅滞なく聯合信任に通知するものとする。
                        </p>
                    </div>
                    <h2>Ⅱ 情報収集の許可</h2>
                    <div class="section">
                        <p>
                            ユーザーがトラステッド・タイムスタンプのサービスを利用する時に、ユーザーにより良いサービスを提供し、サービスの品質を向上させるために、聯合信任は、ユーザーの関連情報（以下、「ユーザー情報」という）を収集する権利を有する。ユーザー情報は以下を含むが、それらに限定されない。
                        </p>
                        <p>
                            1.
                            身分証明書情報、企業ライセンスの関連情報、連絡先電話番号、連絡先住所、実際の居住地などを含む個人、企業、他の組織の関連情報。
                        </p>
                        <p>
                            2.
                            ユーザーがトラステッド・タイムスタンプのサービスを利用する過程で提供、形成するデータ情報。
                        </p>
                        <p>
                            3.
                            ユーザーが第三者に提供する又は第三者に開示する、トラステッド・タイムスタンプでのユーザーの登録又はサービス利用に関連する情報及び個人情報。
                        </p>
                        <p>
                            4.
                            ユーザーがトラステッド・タイムスタンプ又はサブウェブサイトのウェブページ、App、ミニプログラム、モバイルウェブページにログインして利用する時間、期間、支払い情報、銀行口座情報、及びサービス利用履歴と記録。
                        </p>
                        <p>
                            5. ユーザーが利用するコンピュータ、モバイル機器のブランド、型番、IPアドレス及びソフトウェアバージョンなどの情報。
                        </p>
                        <p>
                            6. 上記の目的のために、cookie又は他の手段で自動的に収集された他の情報又は個人情報。
                        </p>
                        <p>
                            7. ユーザーが測位機能を有するモバイル機器によってトラステッド・タイムスタンプのApp又はモバイルウェブページにログインして利用する場合、トラステッド・タイムスタンプは、GPS又はWifiでユーザーの地理的位置情報を収集する権利を有し、地理的位置情報の収集に同意しない場合は、モバイル機器のこの機能を利用しないものとする（ただし、この機能を利用しない場合、一部のサービスが利用できなくなる恐れがある）。
                        </p>
                    </div>
                    <h2>Ⅲ　情報開示の許可</h2>
                    <div class="section">
                        <p>
                            聯合信任は、以下の状況のいずれか又は下記第4条の合理的利用を目的とする第三者への開示を除き、無関係な第三者にユーザー情報を開示しない。
                        </p>
                        <p>1. 中国の法律・法規の規定に基づく開示。</p>
                        <p>
                            2.
                            法的手続きに基づく中国の司法機関及び他の管轄機関の要請に応じた開示。
                        </p>
                        <p>3. 聯合信任又はユーザーの正当な権利と利益を保護するための開示。</p>
                        <p>
                            4.
                            緊急の場合、他のユーザー又は第三者の身の安全を保護するための開示。
                        </p>
                        <p>5. ユーザー自身又は後見人によって許可された開示。</p>
                        <p>6. ユーザーの後見人の法的要求に応じた、その者への開示。</p>
                        <p>
                            聯合信任は前項の規定に従ってユーザー情報を開示する場合、データ情報の受信方に、中国の法律・法規の規定及び委託規約の規定範囲内でユーザー情報を使用及び保護することを要求する。
                        </p>
                    </div>
                    <h2>Ⅳ　情報の合理的利用の許可</h2>
                    <div class="section">
                        <p>
                            聯合信任は、ユーザーが提供した情報、及びトラステッド・タイムスタンプが収集した情報を、以下の1つ又は複数の目的の組み合わせを含み、また、それらに限定されない目的で使用する権利を有し、この目的は、聯合信任によって実施しても、聯合信任が委託する第三者によって実施してもよい（ただし、第三者の行為は、聯合信任と締結した委託規約に制限され、関連規定に合致する必要がある）。
                        </p>
                        <p>
                            1.
                            ユーザーがトラステッド・タイムスタンプのウェブページ又はサブウェブサイト、独立して運営するウェブサイト、App、ミニプログラムにログインする時の、ユーザーの身分認証、ユーザーの料金支払い、ユーザーへのトラステッド・タイムスタンプの関連サービスの提供。
                        </p>
                        <p>
                            2.
                            聯合信任によるユーザーのニーズの分析、理解、新しいビジネスモデル及び新製品の設計、ユーザー及び他者への新しい製品及びサービスの推薦、又は聯合信任の新しい事業の開発。
                        </p>
                        <p>
                            3.
                            聯合信任のサービスにおける製品、サービス及び他のプロモーション効果の評価及び改良。
                        </p>
                        <p>
                            4.
                            トラステッド・タイムスタンプ、サブウェブサイト、独立して運営するウェブサイト、App、ミニプログラムのアップグレード、改訂。
                        </p>
                        <p>
                            5. トラステッド・タイムスタンプのサービスを改良し、ユーザーエクスペリエンスを向上させる他の目的。
                        </p>
                        <p>
                            聯合信任は、聯合信任が委託する第三者企業又は会社を吸収して合併又は分割することがあり、合併又は分割後、企業又は会社は依然として本『個人情報保護規約』及び他の関連規定に従って関連情報を収集、開示及び保護する権利を有し、改めてユーザーの同意を得る必要はない。
                        </p>
                    </div>
                    <h2>Ⅴ　情報保護の措置</h2>
                    <div class="section">
                        <p>
                            1.
                            ユーザーは自分のアカウント及びパスワードなどのアカウント情報を適切に保管するものとし、ユーザーのユーザー名、パスワード、及びパスワードの回復、ログインなどの操作に使用する情報を他人に開示したり、他人のユーザー名及びパスワードを使用したりしてはならない。ユーザーの過失などのトラステッド・タイムスタンプ以外の原因によるアカウントの違法な使用について、聯合信任は一切の責任を負わない。
                        </p>
                        <p>
                            2.
                            他人のアカウントを盗用してトラステッド・タイムスタンプのサービスを利用し、他人の情報を盗用してトラステッド・タイムスタンプに登録した場合、聯合信任は、実際の権利所有者又は損失を被った当事者と協力して権利を保護する権利を有する。
                        </p>
                        <p>
                            3.
                            聯合信任は、様々なセキュリティ技術と手段によってユーザーのアカウント及びアカウント内のデータ情報を保護して、不正なアクセス、使用、コピー及び漏洩を防止する。ただし、ユーザーは、「ネットワーク技術の発展に制限されるため、絶対的なセキュリティ保証措置はなく、情報漏洩のリスクを完全に回避することはできない」ことを知って、受け入れるものとする。したがって、トラステッド・タイムスタンプ以外の原因による情報漏洩及び他の損失について、聯合信任は一切の責任を負わない。
                        </p>
                    </div>
                    <h2>Ⅵ　機密保持条項</h2>
                    <div class="section">
                        聯合信任及びユーザーは、いずれも機密保持条項を厳守し、双方の営業秘密及び関連する権利と利益を保護する必要がある。製品の知的財産権、企画案、ユーザーのデータ、規約、技術文書、プログラムファイル、ウィジェット又はソースコード、様々なアカウント及びパスワードを含むが、それらに限定されない。いかなる者も相手方の営業秘密を漏洩したり、業務を通じて相手方のノウハウを取得したりしてはならない。双方によって使用が許可された技術について、許可時に指定された範囲内でのみ使用でき、他の目的に使用してはならない。
                    </div>
                    <h2>Ⅶ　第三者ウェブサイト</h2>
                    <div class="section">
                        聯合信任は、第三者ウェブサイトにアクセスするリンクを含み、いつでもパートナーである第三者のウェブサイトへのリンクを追加又は削減する権利を有する。すべての第三者ウェブサイトの個人情報保護措置はトラステッド・タイムスタンプから独立して存在し、これについて聯合信任は一切の責任を負わない。
                    </div>
                    <h2>Ⅷ　賠償制限</h2>
                    <div class="section">
                        本『個人情報保護規約』に違反するか又は本『個人情報保護規約』の一部の条項が無効であるために、聯合信任がユーザーを賠償する必要が生じた場合、賠償の最大額は、『ユーザー登録及び利用規約』の関連規定に従い、即ち、規約違反に対する当社の賠償総額はユーザーに課金された当該サービス費用の総額を超えない。
                    </div>
                    <h2>Ⅸ　その他</h2>
                    <div class="section">
                        <p>
                            1.
                            本『個人情報保護規約』は、『ユーザー登録及び利用規約』の不可分な構成要素であり、同等の法的效力を持つ。本『個人情報保護規約』が『ユーザー登録及び利用規約』と合致しない又は矛盾する場合、本『個人情報保護規約』を適用する。言及されていない内容については、『ユーザー登録及び利用規約』を適用する。
                        </p>
                        <p>
                            2.
                            本『個人情報保護規約』に規定されている条項の一部又は全部が無効である場合も、当該条項の他の部分及び本規約の他の条項の法的效力に影響を与えない。
                        </p>
                        <p>
                            3.
                            本『個人情報保護規約』は中国語版を基準とし、日本語版を参考とする。
                        </p>
                    </div>
                </div>
            </div>
            <div class="footer">
                <div class="check">
                    <el-checkbox v-model="agreement" @change="read()">
                    </el-checkbox>
                    <span>
                        個人情報保護規約の内容を理解した上で同意します</span>
                </div>
                <el-button
                    :disabled="btndisabled"
                    type="primary"
                    @click="nextthree()"
                    >次へ</el-button
                >
                <el-button style="margin-right:15px;" @click="childMethod">取消</el-button>
            </div>
        </el-dialog>
    </div>
</template>

<script>
export default {
    name: "Privacy",
    data() {
        return {
            xieyi: false,
            agreement: false,
            btndisabled: true,
            Language: 1
        };
    },
    props: ["show2","fatherMethod"],
    components: {},

    computed: {},

    created() {
        
    },
    watch: {
        'show2': function (n, o) {
            this.updata()
        }
    },
    mounted() {},

    methods: {
        childMethod(){
            if (this.fatherMethod) {
                this.fatherMethod();
            }
        },
        updata(){
            if (this.show2) {
                this.xieyi = true;
            }
        },
        read() {
            this.btndisabled = !this.agreement;
        },
        tag(e) {
            if (e == 1) {
                this.Language = 1;
            } else {
                this.Language = 2;
            }
        },
        nextthree(){
            this.$emit("show",3);
            this.xieyi=false;
        }
    }
};
</script>
<style scoped>
.Language {
    text-align: right;
}
.Language span {
    display: inline-block;
    width: 68px;
    height: 30px;
    line-height: 30px;
    text-align: center;
    margin: 0 10px;
    background: #f3f3f3;
    color: #000;
    border-radius: 30px;
    cursor: pointer;
}
.Language span.curLan {
    color: #fff;
    background: #6a91f0;
}
.cnt {
    margin-top: 20px;
    padding: 20px;
    font-size: 16px;
    line-height: 30px;
    height: 40vh;
    overflow: auto;
}
.chinese {
    font-family: "Arial", "微软雅黑", "宋体";
}
.cnt h1 {
    font-size: 16px;
    font-weight: bold;
    text-align: center;
}
.section {
    text-indent: 2em;
}
.section-child {
    text-indent: 2em;
    padding-left: 30px;
}
.footer {
    margin-top: 20px;
    overflow: hidden;
}
.footer .el-button {
    float: right;
}
.footer span{
    vertical-align: middle;
}
.check {
    float: left;
    line-height: 40px;
    color: #999;
}
</style>
<style lang="stylus">
.argeement .el-dialog__body{
    padding:20px;
}
</style>
